{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "d7688043-8df3-4f2b-a2bf-1e38712f3103",
   "metadata": {
    "tags": []
   },
   "source": [
    "# Prepare illustrations\n",
    "\n",
    "Initially, we stored the illustrations extracted from the _Repertorio_ somewhere and used the raw URL for the `foaf:depiction` property of our concepts.\n",
    "\n",
    "To clean things up a bit, we do the following:\n",
    "\n",
    "1. Use a w3id namespace instead of raw URLs.\n",
    "2. Use the concept ID as illustration ID instead of the autogenerated filenames.\n",
    "3. Write metadata into the PNG files.\n",
    "4. Write RDF metadata into a separate RDF graph."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "23d7294b-2abc-4296-b05c-3294af8de4b2",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pathlib import Path\n",
    "import re\n",
    "\n",
    "import rdflib\n",
    "\n",
    "from PIL.PngImagePlugin import PngImageFile, PngInfo\n",
    "from PIL import ImageEnhance"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "261b5960-4795-46ff-8492-c85de3fb2733",
   "metadata": {},
   "outputs": [],
   "source": [
    "OLD_ILLUSTRATIONS_DIR = Path.home() / 'Downloads' / 'Repertorio_clean' / 'Repertorio_clean' / 'illustrations'\n",
    "NEW_ILLUSTRATIONS_DIR = Path('illustrations')\n",
    "NEW_ILLUSTRATIONS_DIR.mkdir(exist_ok=True)\n",
    "\n",
    "\n",
    "CREDITS = 'ISMEO/Franceso Martore'\n",
    "AUTHOR = 'Franceso Martore'\n",
    "LICENSE = 'CC BY 4.0'\n",
    "LICENSE_URL = 'https://creativecommons.org/licenses/by/4.0/'\n",
    "SOURCE = ('Faccenna, Domenico, and Anna Filigenzi. 2007. '\n",
    "          'Repertorio terminologico per la schedatura delle sculture dell’arte gandharica. Rome: IsIAO.')\n",
    "COMMENT = 'Edited by the DiGA project <https://w3id.org/diga/>.'\n",
    "\n",
    "OLD_URL_PREFIX = 'https://pages.ceres.rub.de/diga/terms/illustrations/'\n",
    "OLD_URL_PATTERN = f'{OLD_URL_PREFIX}(.*).png'"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3a5d3301-46d4-487c-affb-badd42abd111",
   "metadata": {},
   "source": [
    "We start with the current data from VocBench."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "c860bfac-e93b-4b29-82fd-26e1fdf31eb1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Nc0aa901507d042639b8a16c613aad2cd (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g = rdflib.Graph()\n",
    "g.parse('diga_terms_vocbench.ttl')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c541201a-4859-4e53-b7ee-a428e4ee3d65",
   "metadata": {},
   "source": [
    "Now let’s run a few tests to make sure that our assumptions about the data are met."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "6fad0381-9ce4-42f4-b096-414c03f7e04d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "https://w3id.org/diga/terms/1000747715 1000747715 Repertorio-198_Graphic_1621265402512_353\n",
      "https://w3id.org/diga/terms/1035523561 1035523561 Repertorio-059_Graphic_1621258346688_505\n",
      "https://w3id.org/diga/terms/1036537964 1036537964 Repertorio-032_Graphic_1619536280979_211\n"
     ]
    }
   ],
   "source": [
    "res = g.query('''\n",
    "SELECT ?concept ?id ?img\n",
    "WHERE {\n",
    "    ?concept a skos:Concept .\n",
    "    ?concept dc:identifier ?id .\n",
    "    ?concept foaf:depiction ?img .\n",
    "} LIMIT 3\n",
    "''')\n",
    "\n",
    "for concept, id_, img in res:\n",
    "    print(concept, id_, re.match(OLD_URL_PATTERN, img).group(1))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "03063497-cc68-4f70-8a92-223a98f856a5",
   "metadata": {},
   "source": [
    "Are there any concepts with more than one image? (In that case, we cannot simply use the ID as image name.)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "001f5fc4-5057-4d6c-9ec1-b26317e4797c",
   "metadata": {},
   "outputs": [],
   "source": [
    "res = g.query('''\n",
    "SELECT ?concept (count(?img) as ?imgcount)\n",
    "WHERE {\n",
    "    ?concept a skos:Concept .\n",
    "    ?concept foaf:depiction ?img .\n",
    "} GROUP BY ?concept\n",
    "HAVING ( count(?img) > 1 )\n",
    "''')\n",
    "for concept, count in res:\n",
    "    print(concept, count.value)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fbff093f-6e3f-4bf6-8590-42aaa5e3479c",
   "metadata": {},
   "source": [
    "Okay, none have (as expected), so we can continue."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "543810d7-3c12-483b-9a06-33373579669f",
   "metadata": {},
   "source": [
    "Are there images without identifier?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "1e41f9bc-5639-4daa-9231-e44f1fc7ef5d",
   "metadata": {},
   "outputs": [],
   "source": [
    "res = g.query('''\n",
    "SELECT ?concept\n",
    "WHERE {\n",
    "    ?concept a skos:Concept .\n",
    "    ?concept foaf:depiction ?img .\n",
    "    FILTER NOT EXISTS { ?concept dc:identifier ?id . }\n",
    "}\n",
    "''')\n",
    "for concept, in res:\n",
    "    print(concept)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bdc92954-9ac9-4718-96e4-326158d41a01",
   "metadata": {},
   "source": [
    "Also not, so we’re safe to use the identifier as file name."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5ec3b262-7313-4d1a-9707-5428db76a5be",
   "metadata": {},
   "source": [
    "We create a new RDF graph for image information."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "ae7f0540-64ee-4a87-a62d-65748cc9e5db",
   "metadata": {},
   "outputs": [],
   "source": [
    "img_g = rdflib.Graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "45ad094d-c5a9-4cf6-aca1-9fdca4f9fe85",
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib.namespace import RDF, FOAF, DC, DCTERMS\n",
    "\n",
    "DIGA = rdflib.Namespace('https://w3id.org/diga/')\n",
    "ILLUSTRATIONS = rdflib.Namespace('https://w3id.org/diga/illustrations/')\n",
    "CC = rdflib.Namespace('http://creativecommons.org/ns#')\n",
    "\n",
    "img_g.bind('foaf', FOAF)\n",
    "img_g.bind('dc', DC)\n",
    "img_g.bind('dct', DCTERMS)\n",
    "img_g.bind('diga', DIGA)\n",
    "img_g.bind('di', ILLUSTRATIONS)\n",
    "img_g.bind('cc', CC)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7e8e3af3-d28a-4a3f-b809-3b303cb18fb4",
   "metadata": {},
   "source": [
    "Now we walk through the original data. For illustration purposes, let’s look at the transformation steps with the first result.\n",
    "\n",
    "First, get some basic data."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "c3cb70f0-4032-4df3-a033-65e5561fd10a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "https://w3id.org/diga/terms/1000747715 1000747715 spreading upwards and downwards, with lanceolate leaves and blossoms Repertorio-198_Graphic_1621265402512_353\n",
      "/home/frederik/Downloads/Repertorio_clean/Repertorio_clean/illustrations/Repertorio-198_Graphic_1621265402512_353.png True\n",
      "illustrations/1000747715.png\n"
     ]
    }
   ],
   "source": [
    "res = g.query('''\n",
    "SELECT ?concept ?id ?label ?img\n",
    "WHERE {\n",
    "    ?concept a skos:Concept .\n",
    "    ?concept dc:identifier ?id .\n",
    "    ?concept foaf:depiction ?img .\n",
    "    ?concept skosxl:prefLabel ?xlabel .\n",
    "    ?xlabel skosxl:literalForm ?label .\n",
    "    FILTER ( langMatches(lang(?label), 'en') )\n",
    "}\n",
    "''')\n",
    "\n",
    "for concept, id_, label, img in res:\n",
    "    old_name = re.match(OLD_URL_PATTERN, img).group(1)\n",
    "    print(concept, id_, label, old_name)\n",
    "    old_path = OLD_ILLUSTRATIONS_DIR / f'{old_name}.png'\n",
    "    print(old_path, old_path.is_file())\n",
    "    new_path = NEW_ILLUSTRATIONS_DIR / f'{id_}.png'\n",
    "    print(new_path)\n",
    "    break"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "87d01205-03d4-4d9b-9bf3-9a4b37980003",
   "metadata": {},
   "source": [
    "Now, let’s add metadata to the PNG, rename it and save it at the new location."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "7e237d2a-0afe-4161-9893-8c706a1ae7d2",
   "metadata": {},
   "outputs": [],
   "source": [
    "image = PngImageFile(old_path)\n",
    "metadata = PngInfo()\n",
    "metadata.add_text('Author', AUTHOR)\n",
    "metadata.add_text('Title', label)\n",
    "metadata.add_text('Source', SOURCE)\n",
    "metadata.add_text('Copyright', f'© {CREDITS}, {LICENSE} <{LICENSE_URL}>')\n",
    "metadata.add_text('Comment', COMMENT)\n",
    "image.save(new_path, pnginfo=metadata)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "53246a9e-e346-403f-b20c-5ce5f11d57bd",
   "metadata": {},
   "source": [
    "Let’s see how the metadata look like in the final file."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "7922de2a-e9d7-4cbc-b915-f2f3ee8b38a3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'Author': 'Franceso Martore',\n",
       " 'Title': 'spreading upwards and downwards, with lanceolate leaves and blossoms',\n",
       " 'Source': 'Faccenna, Domenico, and Anna Filigenzi. 2007. Repertorio terminologico per la schedatura delle sculture dell’arte gandharica. Rome: IsIAO.',\n",
       " 'Copyright': '© ISMEO/Franceso Martore, CC BY 4.0 <https://creativecommons.org/licenses/by/4.0/>',\n",
       " 'Comment': 'Edited by the DiGA project <https://w3id.org/diga/>.'}"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "im2 = PngImageFile(new_path)\n",
    "im2.text"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cb2aebcc-542f-47d4-8435-7e0ae6bac9a5",
   "metadata": {},
   "source": [
    "Now let’s add RDF metadata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "02e2873a-002d-4fc4-b30d-407028d674cd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix cc: <http://creativecommons.org/ns#> .\n",
      "@prefix dc: <http://purl.org/dc/elements/1.1/> .\n",
      "@prefix dct: <http://purl.org/dc/terms/> .\n",
      "@prefix di: <https://w3id.org/diga/illustrations/> .\n",
      "@prefix diga: <https://w3id.org/diga/> .\n",
      "@prefix foaf: <http://xmlns.com/foaf/0.1/> .\n",
      "\n",
      "di:1000747715 a foaf:Image ;\n",
      "    cc:attributionName \"ISMEO/Franceso Martore\" ;\n",
      "    cc:license <https://creativecommons.org/licenses/by/4.0/> ;\n",
      "    dc:source \"Faccenna, Domenico, and Anna Filigenzi. 2007. Repertorio terminologico per la schedatura delle sculture dell’arte gandharica. Rome: IsIAO.\" ;\n",
      "    dct:creator \"Franceso Martore\" ;\n",
      "    dct:license <https://creativecommons.org/licenses/by/4.0/> ;\n",
      "    dct:publisher diga: ;\n",
      "    dct:title \"spreading upwards and downwards, with lanceolate leaves and blossoms\"@en .\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "iuri = ILLUSTRATIONS.term(id_)\n",
    "img_g.add((iuri, RDF.type, FOAF.Image))\n",
    "img_g.add((iuri, DCTERMS.creator, rdflib.Literal(AUTHOR)))\n",
    "img_g.add((iuri, DCTERMS.title, label))\n",
    "img_g.add((iuri, DC.source, rdflib.Literal(SOURCE)))\n",
    "img_g.add((iuri, DCTERMS.license, rdflib.URIRef(LICENSE_URL)))\n",
    "img_g.add((iuri, CC.license, rdflib.URIRef(LICENSE_URL)))\n",
    "img_g.add((iuri, CC.attributionName, rdflib.Literal(CREDITS)))\n",
    "img_g.add((iuri, DCTERMS.publisher, DIGA.term('')))\n",
    "\n",
    "print(img_g.serialize(format='turtle'))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fced26eb-cd4e-4f54-afbc-668f4cb7543c",
   "metadata": {},
   "source": [
    "Now let’s do the same for all of the data."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "8febb0de-7b03-406d-8670-4a9e334fde1a",
   "metadata": {},
   "outputs": [],
   "source": [
    "res = g.query('''\n",
    "SELECT ?concept ?id ?label ?img\n",
    "WHERE {\n",
    "    ?concept a skos:Concept .\n",
    "    ?concept dc:identifier ?id .\n",
    "    ?concept foaf:depiction ?img .\n",
    "    ?concept skosxl:prefLabel ?xlabel .\n",
    "    ?xlabel skosxl:literalForm ?label .\n",
    "    FILTER ( langMatches(lang(?label), 'en') )\n",
    "}\n",
    "''')\n",
    "\n",
    "for concept, id_, label, img in res:\n",
    "    old_name = re.match(OLD_URL_PATTERN, img).group(1)\n",
    "    old_path = OLD_ILLUSTRATIONS_DIR / f'{old_name}.png'\n",
    "    new_path = NEW_ILLUSTRATIONS_DIR / f'{id_}.png'\n",
    "\n",
    "    # Write image+metadata\n",
    "    image = PngImageFile(old_path)\n",
    "    metadata = PngInfo()\n",
    "    metadata.add_text('Author', AUTHOR)\n",
    "    metadata.add_text('Title', label)\n",
    "    metadata.add_text('Source', SOURCE)\n",
    "    metadata.add_text('Copyright', f'© {CREDITS}, {LICENSE} <{LICENSE_URL}>')\n",
    "    metadata.add_text('Comment', COMMENT)\n",
    "    image.save(new_path, pnginfo=metadata)\n",
    "    \n",
    "    # Add RDF info\n",
    "    iuri = ILLUSTRATIONS.term(id_)\n",
    "    img_g.add((iuri, RDF.type, FOAF.Image))\n",
    "    img_g.add((iuri, DCTERMS.creator, rdflib.Literal(AUTHOR)))\n",
    "    img_g.add((iuri, DCTERMS.title, label))\n",
    "    img_g.add((iuri, DC.source, rdflib.Literal(SOURCE)))\n",
    "    img_g.add((iuri, DCTERMS.license, rdflib.URIRef(LICENSE_URL)))\n",
    "    img_g.add((iuri, CC.license, rdflib.URIRef(LICENSE_URL)))\n",
    "    img_g.add((iuri, CC.attributionName, rdflib.Literal(CREDITS)))\n",
    "    img_g.add((iuri, DCTERMS.publisher, DIGA.term('')))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "19405725-d709-4783-8af9-d0867931fa7e",
   "metadata": {},
   "source": [
    "Now we can save the resulting RDF file."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "3081dc34-3d4a-49ba-b569-ccd3a2c63813",
   "metadata": {},
   "outputs": [],
   "source": [
    "with open('diga_illustrations.rdf', 'wb') as outfile:\n",
    "    img_g.serialize(destination=outfile, format='xml')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "34989454-4537-45dc-b7bc-fcdd12a16310",
   "metadata": {},
   "source": [
    "As the final step, we update the `foaf:depiction` property in the original data. This is done here purely as a test, the actual transformation is run directly in VocBench. It is a one-time operation."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "d34d5d85-6d18-41b1-b034-f8faef29ce70",
   "metadata": {},
   "outputs": [],
   "source": [
    "g.bind('diga_illustrations', ILLUSTRATIONS)\n",
    "\n",
    "res = g.update('''\n",
    "DELETE { ?concept foaf:depiction ?img . }\n",
    "INSERT { ?concept foaf:depiction ?new_img . }\n",
    "WHERE {\n",
    "    ?concept a skos:Concept .\n",
    "    ?concept dc:identifier ?id .\n",
    "    ?concept foaf:depiction ?img .\n",
    "    BIND(URI(CONCAT(STR(diga_illustrations:), ?id)) as ?new_img)\n",
    "}\n",
    "''')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "440ffd53-d749-48fc-8872-45fcf9d0b52a",
   "metadata": {},
   "source": [
    "Now test the results of the update."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "9e8e24c3-1b98-485d-a432-e5d421712717",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "https://w3id.org/diga/terms/1000747715 https://w3id.org/diga/illustrations/1000747715\n",
      "https://w3id.org/diga/terms/1035523561 https://w3id.org/diga/illustrations/1035523561\n",
      "https://w3id.org/diga/terms/1036537964 https://w3id.org/diga/illustrations/1036537964\n"
     ]
    }
   ],
   "source": [
    "res = g.query('''\n",
    "SELECT ?concept ?img\n",
    "WHERE {\n",
    "    ?concept a skos:Concept .\n",
    "    ?concept foaf:depiction ?img .\n",
    "} LIMIT 3\n",
    "''')\n",
    "for concept, img in res:\n",
    "    print(concept, img)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
